; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	image2 - mode
	infrared4 - mode
	spectrograph1 - mode
	thermograph0 - mode
	spectrograph3 - mode
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image2)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared4)
	(supports instrument8 image2)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument9 image2)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument10 spectrograph3)
	(supports instrument10 infrared4)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 image2)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet6)
	(supports instrument12 spectrograph3)
	(supports instrument12 spectrograph1)
	(supports instrument12 image2)
	(calibration_target instrument12 Star0)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 GroundStation4)
	(supports instrument14 image2)
	(supports instrument14 spectrograph3)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite3 GroundStation4)
	(pointing satellite5 Planet6)
	(have_image Planet5 spectrograph3)
	(have_image Planet6 spectrograph3)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon11 spectrograph3)
	(have_image Planet12 image2)
))

)

; plan
1. (turn_to satellite2 star1 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star1)
   goals met: 0 of 11
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 11
3. (calibrate satellite2 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 11
4. (turn_to satellite2 planet12 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet12)
   goals met: 0 of 11
5. (take_image satellite2 planet12 instrument7 image2)
   added: (have_image planet12 image2)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon9 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 11
7. (take_image satellite2 phenomenon9 instrument7 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 11
9. (take_image satellite2 phenomenon8 instrument7 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 3 of 11
10. (turn_to satellite2 phenomenon11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 11
11. (take_image satellite2 phenomenon11 instrument7 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 4 of 11
12. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 11
13. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 11
14. (take_image satellite2 phenomenon10 instrument7 image2)
   added: (have_image phenomenon10 image2)
   goals met: 6 of 11
15. (turn_to satellite2 planet5 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet5)
   goals met: 6 of 11
16. (take_image satellite2 planet5 instrument7 spectrograph3)
   added: (have_image planet5 spectrograph3)
   goals met: 7 of 11
17. (turn_to satellite2 planet6 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet6)
   goals met: 7 of 11
18. (take_image satellite2 planet6 instrument7 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 8 of 11
19. (turn_to satellite2 planet7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet7)
   goals met: 8 of 11
20. (take_image satellite2 planet7 instrument7 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 9 of 11
21. (turn_to satellite3 groundstation4 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 groundstation4)
   goals met: 10 of 11
22. (turn_to satellite5 planet6 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 planet6)
   goals met: 11 of 11
